In [1]:
import pandas as pd

## #(1) 12월 6일자 buy it again 점수

In [3]:
buyit = pd.read_csv('praha.userByItAgainScore.csv')

In [7]:
buyit.head()

                        _id                      date       mid
0  5c0996e66fec50519ddffdf3  2018-12-06T21:35:52.409Z  12364604
1  5c0996e66fec50519ddffdf4  2018-12-06T21:35:52.409Z   4374202
2  5c0996e66fec50519ddffdf5  2018-12-06T21:35:52.409Z  23801000
3  5c0996e66fec50519ddffdf8  2018-12-06T21:35:52.409Z   2188602
4  5c0996e66fec50519ddffdff  2018-12-06T21:35:52.409Z  14952202

In [10]:
buyit.shape

(733294, 3)

- 12월 6일 약 73만명에 대해서 점수가 계산되는군!

---

## #(2) 12월 6일자 memberActionInfos2

In [4]:
memberaction = pd.read_csv('1206memberActionInfos2.csv')

In [6]:
memberaction.head()

                        _id       day      mid
0  5c098e95e24f204cc755cc33  20181206  3022810
1  5c098e95e24f204cc755d255  20181206  3318434
2  5c098e95e24f204cc755cc35  20181206  1748628
3  5c098e95e24f204cc755cc38  20181206  8738835
4  5c098e95e24f204cc755d21d  20181206  1163135

In [11]:
memberaction.shape

(1315052, 3)

- 약 130만명의 활동기록!

---

In [21]:
memberaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1315052 entries, 0 to 1315051
Data columns (total 3 columns):
_id    1315052 non-null object
day    1315052 non-null int64
mid    1315052 non-null int64
dtypes: int64(2), object(1)
memory usage: 30.1+ MB

In [23]:
memberaction[memberaction._id == "5c098ec15f489f6e70c40757"]

                              _id       day       mid
1010971  5c098ec15f489f6e70c40757  20181206  14952202

---

## #(3) 그렇다면 12월 6일 멤버 130만명 중 buy it again 노출 비율은?

* merge로 결과보기

In [13]:
result = pd.merge(buyit, memberaction, on='mid')

In [24]:
result.head()

,_id_x,date,mid,_id_y,day
0,5c0996e66fec50519ddffdff,2018-12-06T21:35:52.409Z,14952202,5c098ec15f489f6e70c40757,20181206
1,5c0996e66fec50519ddffe1f,2018-12-06T21:35:52.409Z,7885200,5c098ec15f489f6a9399fc7e,20181206
2,5c0996e66fec50519ddffe39,2018-12-06T21:35:52.409Z,20233407,5c098ea9e24f204cc36f723d,20181206
3,5c0996e66fec50519ddffe3c,2018-12-06T21:35:52.409Z,7273401,5c098ec8dc421e7c38603eed,20181206
4,5c0996e66fec50519ddffe57,2018-12-06T21:35:52.409Z,9199400,5c098ec95f489f6a0f7136f2,20181206

In [42]:
result.shape

(358198, 5)

---

* <U>concat로 결과주기 - concat은 여기에 적합하지 않나본데?</U>

In [18]:
result1 = pd.concat([buyit.mid, memberaction.mid], axis=1, join='inner')

In [25]:
result1.head()

        mid      mid
0  12364604  3022810
1   4374202  3318434
2  23801000  1748628
3   2188602  8738835
4  14952202  1163135

In [20]:
result1.columns

Index(['mid', 'mid'], dtype='object')

---

## #(4) member의 등급을 활용 할 수 있지 않을까?

In [27]:
info = pd.read_csv('memberinfo.csv')

In [28]:
info.head()

       _id  g      mid
0  1026018  9  1026018
1  1026034  9  1026034
2  1026050  9  1026050
3  1026054  9  1026054
4  1026086  9  1026086

In [29]:
result.head()

,_id_x,date,mid,_id_y,day
0,5c0996e66fec50519ddffdff,2018-12-06T21:35:52.409Z,14952202,5c098ec15f489f6e70c40757,20181206
1,5c0996e66fec50519ddffe1f,2018-12-06T21:35:52.409Z,7885200,5c098ec15f489f6a9399fc7e,20181206
2,5c0996e66fec50519ddffe39,2018-12-06T21:35:52.409Z,20233407,5c098ea9e24f204cc36f723d,20181206
3,5c0996e66fec50519ddffe3c,2018-12-06T21:35:52.409Z,7273401,5c098ec8dc421e7c38603eed,20181206
4,5c0996e66fec50519ddffe57,2018-12-06T21:35:52.409Z,9199400,5c098ec95f489f6a0f7136f2,20181206

### # 이렇게

In [30]:
result_ = pd.merge(result, info, on='mid')

In [44]:
358038/1315052

0.2722614771126921

In [32]:
result_.shape, result.shape  # user등급이 없는애도 있나보다!

((358038, 7), (358198, 5))

In [33]:
result_.head()

,_id_x,date,mid,_id_y,day,_id,g
0,5c0996e66fec50519ddffdff,2018-12-06T21:35:52.409Z,14952202,5c098ec15f489f6e70c40757,20181206,14952202,1
1,5c0996e66fec50519ddffe1f,2018-12-06T21:35:52.409Z,7885200,5c098ec15f489f6a9399fc7e,20181206,7885200,9
2,5c0996e66fec50519ddffe39,2018-12-06T21:35:52.409Z,20233407,5c098ea9e24f204cc36f723d,20181206,20233407,3
3,5c0996e66fec50519ddffe3c,2018-12-06T21:35:52.409Z,7273401,5c098ec8dc421e7c38603eed,20181206,7273401,2
4,5c0996e66fec50519ddffe57,2018-12-06T21:35:52.409Z,9199400,5c098ec95f489f6a0f7136f2,20181206,9199400,2

In [34]:
result_.groupby('g').count()

    _id_x    date     mid   _id_y     day     _id
g
0    5069    5069    5069    5069    5069    5069
1   72855   72855   72855   72855   72855   72855
2   82346   82346   82346   82346   82346   82346
3   46776   46776   46776   46776   46776   46776
8    2467    2467    2467    2467    2467    2467
9  148525  148525  148525  148525  148525  148525

---

In [35]:
memberaction_ = pd.merge(memberaction, info, on='mid')

In [36]:
memberaction_.shape, memberaction.shape

((1312204, 5), (1315052, 3))

In [38]:
memberaction.shape[0] - memberaction_.shape[0]  # 2848명이 그때 당시에는

2848

In [39]:
memberaction_.groupby('g').count()

    _id_x     day     mid   _id_y
g
0   70447   70447   70447   70447
1  197824  197824  197824  197824
2  174500  174500  174500  174500
3   82517   82517   82517   82517
8   24347   24347   24347   24347
9  762569  762569  762569  762569

In [41]:
info.groupby('g').count()

        _id       mid
g
0   4430363   4430363
1    514790    514790
2    357962    357962
3    158560    158560
8   4500095   4500095
9  10748121  10748121

In [43]:
info.shape

(20709891, 3)